app/Controllers/Voting.php

public function vote()
{
    if(session()->get('id')>0) {
    $voteModel = new H_model();
    $kandidatModel = new K_model();
    $userId = session()->get('id');
    $kandidatId = $this->request->getPost('kandidatId');

    $existingVote = $voteModel->where('user_id', $userId)->first();
    if ($existingVote) {
        return redirect()->to('/Voting/s_memilih');
    } else {
        $voteModel->savee([
            'user_id' => $userId,
            'kandidat_id' => $kandidatId
        ]);


        $kandidatModel->where('id', $kandidatId)->increment('suara');
---
UPDATE `kandidat` SET `suara` = `suara` + 1
WHERE `id` = '24'