app/Models/K_model.php

    public function join2($table1, $table2, $on)
    {
        return $this->db->table($table1)
            ->select($table1 . '.*, ketua.nama as ketua_username, wakil.nama as wakil_username, wakil2.nama as wakil2_username')
            ->join($table2 . ' as ketua', 'ketua.id_user = ' . $table1 . '.ketua', 'left')
            ->join($table2 . ' as wakil', 'wakil.id_user = ' . $table1 . '.wakil', 'left')
            ->join($table2 . ' as wakil2', 'wakil2.id_user = ' . $table1 . '.wakil2', 'left')
            ->where('kandidat.deleted_at', null)
            ->get()
            ->getResult();
---
SELECT `kandidat`.*, `ketua`.`username` as `ketua_username`, `wakil`.`username` as `wakil_username`, `wakil2`.`username` as `wakil2_username`
FROM `kandidat`
LEFT JOIN `user` as `ketua` ON `ketua`.`id_user` = `kandidat`.`ketua`
LEFT JOIN `user` as `wakil` ON `wakil`.`id_user` = `kandidat`.`wakil`
LEFT JOIN `user` as `wakil2` ON `wakil2`.`id_user` = `kandidat`.`wakil2`
WHERE `kandidat`.`deleted_at` IS NULL

    public function getKandidatWithUsername($periode_id)
    {
        $builder = $this->db->table('kandidat');
        $builder->select('kandidat.*, ketua.nama as ketua_username, wakil.nama as wakil_username, wakil2.nama as wakil2_username');
        $builder->join('user as ketua', 'ketua.id_user = kandidat.ketua', 'left');
        $builder->join('user as wakil', 'wakil.id_user = kandidat.wakil', 'left');
        $builder->join('user as wakil2', 'wakil2.id_user = kandidat.wakil2', 'left');
        $builder->where('periode_id', $periode_id);
        $builder->where('kandidat.deleted_at', null);
        $builder->groupBy('kandidat.id');
        return $builder->get()->getResultArray();
---
SELECT `kandidat`.*, `ketua`.`username` as `ketua_username`, `wakil`.`username` as `wakil_username`, `wakil2`.`username` as `wakil2_username`
FROM `kandidat`
LEFT JOIN `user` as `ketua` ON `ketua`.`id_user` = `kandidat`.`ketua`
LEFT JOIN `user` as `wakil` ON `wakil`.`id_user` = `kandidat`.`wakil`
LEFT JOIN `user` as `wakil2` ON `wakil2`.`id_user` = `kandidat`.`wakil2`
WHERE `periode_id` = '6'
AND `kandidat`.`deleted_at` IS NULL
GROUP BY `kandidat`.`id`

    public function getAllKandidatWithUsername()
    {
        $builder = $this->db->table('kandidat');
        $builder->select('kandidat.*, ketua.nama as ketua_username, wakil.nama as wakil_username, wakil2.nama as wakil2_username');
        $builder->join('user as ketua', 'ketua.id_user = kandidat.ketua', 'left');
        $builder->join('user as wakil', 'wakil.id_user = kandidat.wakil', 'left');
        $builder->join('user as wakil2', 'wakil2.id_user = kandidat.wakil2', 'left');
        $builder->where('kandidat.deleted_at', null);
        $builder->groupBy('kandidat.id');
        return $builder->get()->getResultArray();
---
SELECT `kandidat`.*, `ketua`.`username` as `ketua_username`, `wakil`.`username` as `wakil_username`, `wakil2`.`username` as `wakil2_username`
FROM `kandidat`
LEFT JOIN `user` as `ketua` ON `ketua`.`id_user` = `kandidat`.`ketua`
LEFT JOIN `user` as `wakil` ON `wakil`.`id_user` = `kandidat`.`wakil`
LEFT JOIN `user` as `wakil2` ON `wakil2`.`id_user` = `kandidat`.`wakil2`
WHERE `kandidat`.`deleted_at` IS NULL
GROUP BY `kandidat`.`id`

    public function getData($level)
    {
        $query = $this->db->table($this->table)
            ->select('kandidat.id, kandidat.ketua, ketua.nama as ketua_username, kandidat.wakil, wakil.nama as wakil_username, kandidat.wakil2, wakil2.nama as wakil2_username, kandidat.visimisi, COUNT(hasil_vote.kandidat_id) as total_vote')
            ->join('hasil_vote', 'hasil_vote.kandidat_id = kandidat.id', 'left')
            ->join('user as ketua', 'ketua.id_user = kandidat.ketua', 'inner')
            ->join('user as wakil', 'wakil.id_user = kandidat.wakil', 'inner')
            ->join('user as wakil2', 'wakil2.id_user = kandidat.wakil2', 'inner')
            ->where('kandidat.deleted_at', null);

        if ($level != 1 && $level != 2) {
            $query->where('kandidat.status2', 'Tampil');
        }

        $query->groupBy('kandidat.id');
        return $query->get()->getResultArray();
---
SELECT `kandidat`.`id`, `kandidat`.`ketua`, `ketua`.`username` as `ketua_username`, `kandidat`.`wakil`, `wakil`.`username` as `wakil_username`, `kandidat`.`wakil2`, `wakil2`.`username` as `wakil2_username`, `kandidat`.`visimisi`, COUNT(hasil_vote.kandidat_id) as total_vote
FROM `kandidat`
LEFT JOIN `hasil_vote` ON `hasil_vote`.`kandidat_id` = `kandidat`.`id`
INNER JOIN `user` as `ketua` ON `ketua`.`id_user` = `kandidat`.`ketua`
INNER JOIN `user` as `wakil` ON `wakil`.`id_user` = `kandidat`.`wakil`
INNER JOIN `user` as `wakil2` ON `wakil2`.`id_user` = `kandidat`.`wakil2`
WHERE `kandidat`.`deleted_at` IS NULL
AND `kandidat`.`status2` = 'Tampil'
GROUP BY `kandidat`.`id`

public function getAllKandidatByPeriodeId($periode_id)
{
    return $this->db->table('kandidat')
        ->where('periode_id', $periode_id)
        ->get()
        ->getResultArray();
---
SELECT *
FROM `kandidat`
WHERE `periode_id` = '6'