app/Models/M_model.php

SELECT *
FROM `user`
LEFT JOIN `level` ON `user`.`level` = `level`.`id_level`
WHERE `user`.`deleted_at` IS NULL
---
	public function join2($table1, $table2, $on){
    return $this->db->table($table1)
                    ->join($table2, $on, 'left')
                    ->where('user.deleted_at', null)
                    ->get()
                    ->getResult();