app/Models/V_model.php

SELECT vote.*, CASE WHEN vote.p_mulai <= "2023-10-04 23:58:50" AND vote.p_selesai >= "2023-10-04 23:58:50" THEN "Aktif" ELSE "Tidak-Aktif" END AS status
FROM `vote`
WHERE `deleted_at` IS NULL
UPDATE `vote` SET `status` = 'Aktif'
WHERE `id` = '6'
---
    public function getPeriodesWithStatus()
    {
        $current_date = date('Y-m-d H:i:s');
        $builder = $this->db->table('vote');
        $builder->select('vote.*,
                          CASE WHEN vote.p_mulai <= "' . $current_date . '" AND vote.p_selesai >= "' . $current_date . '" THEN "Aktif"
                               ELSE "Tidak-Aktif" END AS status', FALSE);
        $builder->where('deleted_at IS NULL');
        $query = $builder->get();


        $result = $query->getResult();
        foreach ($result as $row) {
            $this->db->table('vote')
                     ->where('id', $row->id)
                     ->update(['status' => $row->status]);

SELECT `status2`
FROM `kandidat`
LEFT JOIN `vote` ON `kandidat`.`periode_id` = `vote`.`id`
---
public function getStatus2Selesai()
{
    $query = $this->db->table('kandidat')
        ->select('status2')
        ->join('vote', 'kandidat.periode_id = vote.id', 'left')
        ->get();